# Напишите программу для. проверки истинности утверждения
# ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

# Таблица истинности для данного выражения:
#   X  |  Y  |  Z  |! ( X + Y + Z )|! X * ! Y * ! Z
# -----+-----+-----+---------------+---------------
#   0  |  0  |  0  |       1       |       1
#   0  |  0  |  1  |       0       |       0
#   0  |  1  |  0  |       0       |       0
#   0  |  1  |  1  |       0       |       0
#   1  |  0  |  0  |       0       |       0
#   1  |  0  |  1  |       0       |       0
#   1  |  1  |  0  |       0       |       0
#   1  |  1  |  1  |       0       |       0

x, y, z = list(map(bool, map(int, input(
    'Введите X,Y,Z (через пробел; 1 = True; 0 = False): ').split())))
result = (not (x or y or z)) == (not x and not y and not z)
print(f'Результат: {result}')
